import { FC } from 'react';

import styles from '../styles/footer/footer.module.css';
import { Link } from 'react-router-dom';
import FooterLogo from './footer-logo';

const Footer: FC = () => {
    return <>
        <div className={styles.footerContainer}>  
            <div className={styles.footerMain}>
                    <div className={styles.contentRow}>
                        <div className={styles.logoHolder}>
                            <FooterLogo />
                            <div className={styles.socialLinks}>
                                <Link to='' >
                                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M36.682 3.33301C37.8119 3.33301 38.6643 4.40701 38.2084 6.40466L32.6778 34.6509C32.2912 36.6593 31.1712 37.1426 29.625 36.2082L16.4328 25.6508C16.3816 25.611 16.34 25.5586 16.3112 25.4979C16.2825 25.4372 16.2675 25.37 16.2675 25.3017C16.2675 25.2335 16.2825 25.1663 16.3112 25.1056C16.34 25.0449 16.3816 24.9925 16.4328 24.9527L30.904 11.4095C31.5978 10.7436 30.7553 10.4214 29.8435 11.0229L11.487 22.7295C11.429 22.7705 11.3631 22.7966 11.2945 22.8059C11.2258 22.8152 11.156 22.8074 11.0905 22.7832L2.97298 20.0015C1.16909 19.4323 1.16909 18.0898 3.37935 17.1339L35.8594 3.55855C36.1169 3.42464 36.3967 3.34796 36.682 3.33301Z" fill="white"/>
                                    </svg>
                                </Link>
                                <Link to=''>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 40 40" fill="none">
                                        <path d="M20 15C18.6739 15 17.4021 15.5268 16.4645 16.4645C15.5268 17.4021 15 18.6739 15 20C15 21.3261 15.5268 22.5979 16.4645 23.5355C17.4021 24.4732 18.6739 25 20 25C21.3261 25 22.5979 24.4732 23.5355 23.5355C24.4732 22.5979 25 21.3261 25 20C25 18.6739 24.4732 17.4021 23.5355 16.4645C22.5979 15.5268 21.3261 15 20 15Z" fill="white"/>
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M13.2 3C10.4948 3 7.90038 4.07464 5.98751 5.98751C4.07464 7.90038 3 10.4948 3 13.2L3 26.8C3 29.5052 4.07464 32.0996 5.98751 34.0125C7.90038 35.9254 10.4948 37 13.2 37H26.8C29.5052 37 32.0996 35.9254 34.0125 34.0125C35.9254 32.0996 37 29.5052 37 26.8V13.2C37 10.4948 35.9254 7.90038 34.0125 5.98751C32.0996 4.07464 29.5052 3 26.8 3L13.2 3ZM12.0667 20C12.0667 17.8959 12.9025 15.8781 14.3903 14.3903C15.8781 12.9025 17.8959 12.0667 20 12.0667C22.1041 12.0667 24.1219 12.9025 25.6097 14.3903C27.0975 15.8781 27.9333 17.8959 27.9333 20C27.9333 22.1041 27.0975 24.1219 25.6097 25.6097C24.1219 27.0975 22.1041 27.9333 20 27.9333C17.8959 27.9333 15.8781 27.0975 14.3903 25.6097C12.9025 24.1219 12.0667 22.1041 12.0667 20ZM27.9333 10.0833C27.9333 11.1787 28.8213 12.0667 29.9167 12.0667C31.012 12.0667 31.9 11.1787 31.9 10.0833C31.9 8.98797 31.012 8.1 29.9167 8.1C28.8213 8.1 27.9333 8.98797 27.9333 10.0833Z" fill="white"/>
                                    </svg>
                                </Link>
                                <Link to=''>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 40 40" fill="none">
                                        <path d="M20 15C18.6739 15 17.4021 15.5268 16.4645 16.4645C15.5268 17.4021 15 18.6739 15 20C15 21.3261 15.5268 22.5979 16.4645 23.5355C17.4021 24.4732 18.6739 25 20 25C21.3261 25 22.5979 24.4732 23.5355 23.5355C24.4732 22.5979 25 21.3261 25 20C25 18.6739 24.4732 17.4021 23.5355 16.4645C22.5979 15.5268 21.3261 15 20 15Z" fill="white"/>
                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M13.2 3C10.4948 3 7.90038 4.07464 5.98751 5.98751C4.07464 7.90038 3 10.4948 3 13.2L3 26.8C3 29.5052 4.07464 32.0996 5.98751 34.0125C7.90038 35.9254 10.4948 37 13.2 37H26.8C29.5052 37 32.0996 35.9254 34.0125 34.0125C35.9254 32.0996 37 29.5052 37 26.8V13.2C37 10.4948 35.9254 7.90038 34.0125 5.98751C32.0996 4.07464 29.5052 3 26.8 3L13.2 3ZM12.0667 20C12.0667 17.8959 12.9025 15.8781 14.3903 14.3903C15.8781 12.9025 17.8959 12.0667 20 12.0667C22.1041 12.0667 24.1219 12.9025 25.6097 14.3903C27.0975 15.8781 27.9333 17.8959 27.9333 20C27.9333 22.1041 27.0975 24.1219 25.6097 25.6097C24.1219 27.0975 22.1041 27.9333 20 27.9333C17.8959 27.9333 15.8781 27.0975 14.3903 25.6097C12.9025 24.1219 12.0667 22.1041 12.0667 20ZM27.9333 10.0833C27.9333 11.1787 28.8213 12.0667 29.9167 12.0667C31.012 12.0667 31.9 11.1787 31.9 10.0833C31.9 8.98797 31.012 8.1 29.9167 8.1C28.8213 8.1 27.9333 8.98797 27.9333 10.0833Z" fill="white"/>
                                    </svg>
                                </Link>
                            </div>
                        </div>
                        <div className={styles.infoHolder}>
                            <div className={styles.footerBlock}>
                                <div className={styles.blockHeader}>График работы</div>
                                <div className={styles.footerLinkGroup}>
                                    <div className={styles.footerLink}>ПН-ПТ: с 10:00 до 20:00</div>
                                    <div className={styles.footerLink}>СБ-ВС: выходные</div>
                                </div>
                            </div>
                            <div className={styles.footerBlock}>
                                <div className={styles.blockHeader}>Клиенту</div>
                                <div className={styles.footerLinkGroup}>
                                    <Link className={styles.footerLink} to=''>Доставка и оплата</Link>
                                    <Link className={styles.footerLink} to=''>Бонусная программа</Link>
                                </div>
                            </div>
                            <div className={styles.footerBlock}>
                                <div className={styles.blockHeader}>О нас</div>
                                <div className={styles.footerLinkGroup}>
                                    <Link className={styles.footerLink} to=''>Политика конфиденциальности</Link>
                                    <Link className={styles.footerLink} to=''>Контакты</Link>
                                </div>
                            </div>
                        </div>
                    </div>

            </div>
            <div className={styles.footerInfo}> 

            </div>
        </div>
    </>
}

export default Footer;